Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/admin/depts/other_files/sami_rapporter_samisktegnsettogit_SA.pdf.tmx
Source language: sme
Languages: nob

source: Bargojoavku rávve Sámedikki ja Gielda- ja guovlodepartemeantta jotkkolaččat gulahallet sihke Norgga Standárdiserenlihtuin ja ovdalis namahuvvon oktasašdavviriikkalaš politihkalaš orgánain dán áššis .
nob: Arbeidsgruppen anbefaler at Sametinget og Kommunal- og regionaldepartementet har en løpende dialog både med Norges Standardiseringsforbund og med det tidligere nevnte fellesnordiske poliske organ om denne saken .

source: 8 Árvvoštallamat Geatnegasvuođat maid stáhta lea váldán badjelasas ILO-soahpamuša nr. 169 , Eurohpalaš lihtu guovllu- ja veahádatgielaid birra , ON-konvenšuvnna siviila ja ja politihkalaš vuoigatvuođaid birra ja sámelága bokte , mielddisbuktet ahte stáhta ferte láhčit dilálašvuođaid sámi giela ja čálamearkačohkiid geavaheapmái dihtoriin .
nob: 8 Vurderinger Forpliktelser staten har påtatt seg gjennom ILO-konvensjon 169 , Europeisk pakt om regions- eller minoritetsspråk , FN-konvensjonen om sivile og politiske rettigheter og sameloven , innebærer at staten må legge til rette for bruk av samisk språk og tegnsett på data .

source: Teknologalaš gárgedus IT-suorggis lea dakkár ahte čuolmmat sámi čálamearkačohkiid ja IT hárrái guhki vuollái soitet čoavdásit almmá stádalaš mieldeváikkuheamihaga .
nob: Den teknologiske utvikling innen IT-bransjen er av en slik art at problemene med samisk tegnsett og IT på sikt muligens vil løse seg uten statlig medvirkning .

source: Seammás ádjána muhtun áiggi ovdal go Unicode lea ollásit lávdan .
nob: Det vil samtidig ta en viss tid før Unicode er fullt utbredt .

source: Danne sáhttet ain šaddat čuolmmat sámi čálamearkačohkiiguin , erenoamážit boares datamateriála ja boares prográmmaid hárrái .
nob: Det vil derfor fortsatt kunne oppstå problemer med samiske tegnsett , spesielt i forhold til gammelt datamateriale og gamle program .

source: IT-suorgi ja prográmmagálvoindustriija ráđđejit eanaš priváhta oassádallit .
nob: IT-bransjen og programvareindustrien er i stor grad dominert av private aktører .

source: Danne sáhttá stáhta váldosaččat rollas bokte márkanoassádallin váikkuhit ja hoahpuhit gárgedusa mii dahká vejolažžan čállit ja sáddet sámi čálamearkkaid dihtoriin .
nob: Det er derfor hovedsakelig gjennom sin rolle som markedsaktør staten kan påvirke og påskynde utviklingen som gjør det mulig å skrive og sende samiske tegn på data .

source: Lassin sáhttet stádalaš orgánat fuolahit ahte sámi čála sáhttá geavahuvvot stáda iežas orgánaid luhtte .
nob: I tillegg kan statlige organer påse at samisk skrift kan brukes hos statens egne organer .

source: Sámi čálamearkačohkiid geavaheapmái láhčin sáhttá maiddái leat miellaguoddogažaldat .
nob: Å legge til rette for bruk av samisk tegnsett kan også være et holdningsspørsmål .

source: Danne lea dárbbašlaš dahkat stádalaš etáhtaid dihtomielalažžan das ahte stáhta lea geatnegahttojuvvon báikenammalága mielde geavahit sámi sierramearkkaid adreassaregistariin .
nob: Det er derfor nødvendig å bevisstgjøre statlige etater om at staten er forpliktet til etter stadnamnlova å bruke samiske spesialtegn i adresseregistre .

source: Unicode lávddu geažil eai leat šat teknihkalaš hehttehusat dasa ahte dát sáhttá dáhpáhuvvat .
nob: Gjennom utbredelsen av Unicode er det ikke lengre tekniske hindrer for at dette skal kunne skje .

source: Stádalaš etáhtat berrejit danne ávžojuvvot dahkat sámi sierramearkkaid geavaheami ollásit vejolažžan , maiddái lassin dasa maid láhka skihkke .
nob: Statlige etater bør derfor henstilles til å åpne for bruk av samiske spesialtegn fullt ut , også utover hva loven pålegger .

source: Čuolmmat mat čatnasit sámi čálamearkkaide ja IT:i leat oktasaččat Norgii , Ruŧŧii ja Supmii .
nob: Problemene knyttet til samiske tegn og IT er felles for Norge , Sverige og Finland .

source: Danne lea lunddolaš ahte davviriikkalaš eiseválddit barget ovttas hástalusaid hárrái .
nob: Det er derfor naturlig at de nordiske lands myndigheter samarbeider om utfordringene .

source: Juos buot davviriikkat čađahit standárdiserenbarggu ja bidjet doibmii sisaoastingáibádusaid Unicode birra , de arvvosmahtášii dát dihtorsuorggi doibmiibidjat vuođđolávddiid mat siskkildit sámi čálamearkkaid .
nob: Dersom alle nordiske land gjennomfører standardiseringsarbeid og iverksetter innkjøpskrav om Unicode , vil dette kunne stimulere databransjen til å implementere plattformer som innbefatter samiske tegn .

source: Ain dárbbašuvvojit standárdiseremat 8-bits čálamearkačohkiid hárrái .
nob: Det vil likevel fortsatt være behov for standardiseringer når det gjelder 8-bits tegnsett .

source: Bargojoavku doarju álgagiid mat leat dahkkojuvvon ruoŧa bealde .
nob: Arbeidsgruppen støtter de initiativ som er tatt på svensk side .

source: Bargojoavku doarju maiddái álgagiid mat leat dahkkojuvvon boallobeavdečovdosiid standárdiserema hárrái sámegiela várás .
nob: Arbeidsgruppen støtter også de initiativ som er gjort når det gjelder standardisering av tastaturløsninger for samisk .

source: Lea maiddái dárbbašlaš doallat dialoga Norgga Standárdiserenlihtuin gažaldagaid hárrái mat leat váldojuvvon ovdan .
nob: Det er også nødvendig med en dialog med Norges Standardiseringsforbund om de spørsmål som er tatt opp .

source: Dát lea sihke Sámedikki ja guoskevaš departemeanttaid ovddasvástádus .
nob: Dette er et ansvar både for Sametinget og de berørte departementer .

source: 9 Bargojoavkku neavvagat Departemeanttat fertejit dahkat vuolit etáhtaid dihtomielalažžan das ahte fertejit doibmiibidjat vuogádagaid mat vuođđuduvvet Unicode:i .
nob: 9 Arbeidsgruppens anbefalinger Departementene må bevisstgjøre underliggende etater på at man må implementere systemer som baserer seg på Unicode .

source: Stádalaš sisaoastinšiehtadusat prográmmaháhkkiiguin fertejit sisdoallat gáibádusaid ahte visot prográmmagálvu galgá doarjut Unicode – juogo hágadettiin dahje dihto áigebaji sisa .
nob: Statlige innkjøpsavtaler med programvareleverandører må inneholde krav om at all programvare skal støtte Unicode – enten ved levering eller innenfor et gitt tidsrom .

source: Departemeanttat ja vuolit etáhtat fertejit ođasmahttit iežaset prográmmagálvvu vai ovdanbuktin ja áššegieđahallan šaddá vejolažžan sámegillii , sihke interneahtas ja deaddiluvvon publikašuvnnain .
nob: Departementene og underliggende etater må oppgradere egen programvare for å muliggjøre presentasjon og saksbehandling på samisk , både på internett og i trykte publikasjoner .

source: Sámediggi ovttasbarggus Gielda- ja guovlodepartemeanttain čuovvola gažaldaga 8-bits čálamearkačohkiid ja boallobeavdečovdosiid standárdiseremis davviriikkalaččat dahkan álgagiid hárrái ja Norgga Standárdiserenlihtu hárrái .
nob: Sametinget i samarbeid med Kommunal- og regionaldepartementet følger opp spørsmålet om standardisering av 8-bits tegnsett og tastaturløsninger i forhold til det nordiske initiativ som er tatt og i forhold til Norges Standardiseringsforbund .
